

translit = {
'А': 'A', 'Ж': 'Zh', 'Н': 'N', 'Ф': 'F', 'Ъ': 'Ie',
 'Б': 'B', 'З': 'Z', 'О': 'O', 'Х': 'Kh', 'Э': 'E',
 'В': 'V', 'И': 'I', 'П': 'P', 'Ц': 'Ts', 'Ю': 'Iu',
 'Г': 'G', 'Й': 'I', 'Р': 'R', 'Ч': 'Ch', 'Я': 'Ia',
 'Д': 'D', 'К': 'K', 'С': 'S', 'Ш': 'Sh',
 'Е': 'E', 'Л': 'L', 'Т': 'T', 'Щ': 'Shch',
 'Ё': 'E', 'М': 'M', 'У': 'U', 'Ы': 'Y',
 'а': 'a',
 'ж': 'zh',
 'н': 'n',
 'ф': 'f',
 'ъ': 'ie',
 'б': 'b',
 'з': 'z',
 'о': 'o',
 'х': 'kh',
 'э': 'e',
 'в': 'v',
 'и': 'i',
 'п': 'p',
 'ц': 'ts',
 'ю': 'iu',
 'г': 'g',
 'й': 'i',
 'р': 'r',
 'ч': 'ch',
 'я': 'ia',
 'д': 'd',
 'к': 'k',
 'с': 's',
 'ш': 'sh',
 'е': 'e',
 'л': 'l',
 'т': 't',
 'щ': 'shch',
 'ё': 'e',
 'м': 'm',
 'у': 'u',
 'ы': 'y',
 'ь': ''
}

x = input()
for s in x:
    print(translit.get(s, s), end = '')